## 데이터 핸들링 - 판다스
- 주로 2차원의 데이터를 효율적으로 가공 및 처리하는 라이브러리
- 넘파이보다 고수준 API를 제공하고 데이터셋의 유연한 처리가 가능함.

In [54]:
import pandas as pd

In [55]:
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:', type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

In [56]:
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [57]:
print('Dataframe 크기 :', titanic_df.shape)

Dataframe 크기 : (891, 12)

In [58]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [59]:
titanic_df.describe()

       PassengerId    Survived      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [60]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [61]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [62]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [63]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
Pclass
3    491
1    216
2    184
Name: count, dtype: int64

### DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환
- Dataframe : 리스트, 넘파이 ndarray와 달리 칼럼명을 가짐.
- Dataframe은 2차원 데이터이므로, 2차원 이하의 데이터들만 Dataframe으로 변환될 수 있음.

In [64]:
# 1차원 데이터를 기반으로 2차원 Dataframe을 생성 (칼럼명 하나만 필요)
import numpy as np

col_name1 = ['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print('array shape:', array1.shape)
#리스트를 이용해 data frame 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 Dataframe:\n', df_list1)
#넘파이 ndarray를 이용해 Dataframe 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 Dataframe:\n', df_array1)

array shape: (3,)
1차원 리스트로 만든 Dataframe:
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 Dataframe:
    col1
0     1
1     2
2     3

In [65]:
# 2차원 데이터를 기반으로 Dataframe 생성

# 2*3 데이터이므로 칼럼명 3개가 필요함
col_name2 = ['col1','col2','col3']
# 2행*3열 형태의 리스트와 ndarray 생성한 뒤 이를 Dataframe으로 변환
list2 = [[1,2,3],
         [11,12,13]]
array2 = np.array(list2)
print('array shape:', array2.shape)
df_list2 = pd.DataFrame(list2)
print('2차원 리스트로 만든 Dataframe:\n', df_list2)
df_array2 = pd.DataFrame(array2)
print('2차원 ndarray로 만든 Dataframe:\n', df_array2)

array shape: (2, 3)
2차원 리스트로 만든 Dataframe:
     0   1   2
0   1   2   3
1  11  12  13
2차원 ndarray로 만든 Dataframe:
     0   1   2
0   1   2   3
1  11  12  13

In [66]:
# 딕셔너리 -> dataframe

# key는 문자형 칼럼명으로 매핑, value는 리스트 형(또는 ndarray) 칼럼 데이터로 매핑.
dict = {'col1':[1,11], 'col2':[2,12], 'col3':[3,13]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 Dataframe :\n', df_dict)

딕셔너리로 만든 Dataframe :
    col1  col2  col3
0     1     2     3
1    11    12    13

### DataFrame을 넘파이 ndarray 리스트, 딕셔너리로 변환
- 다수의 머신러닝 패키지가 넘파이 ndarray를 기본 데이터 형으로 사용하므로 Dataframe을 ndarray로 변환하는 경우가 다수 존재

In [67]:
# Dataframe -> ndarray
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 12 13]]

In [68]:
# Dataframe -> list
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입 :', type(list3))
print(list3)

# Dataframe -> dictionary
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입 :', type(dict3))
print(dict3)

df_dict.values.tolist() 타입 : <class 'list'>
[[1, 2, 3], [11, 12, 13]]

 df_dict.to_dict() 타입 : <class 'dict'>
{'col1': [1, 11], 'col2': [2, 12], 'col3': [3, 13]}

### DataFrame의 칼럼 데이터 세트 생성과 수정
- [] 연산자로 생성과 수정 가능

In [69]:
# 타이타닉 데이터 셋에 새로운 칼럼을 추가하고 일괄적으로 0을 할당
titanic_df['Age_0'] = 0
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0

In [70]:
# 기존 칼럼 Series 데이터를 이용해 새로운 칼럼 Series 만들기
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      220.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      380.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      260.0          1

In [71]:
# 기존 칼럼 값 일괄적으로 업데이트
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      360.0          1

### DataFrame 데이터 삭제
- drop() 메서드를 이용
- drop() : labels(원하는 로우/칼럼 명), axis(특정 칼럼/행 드롭), index, columns, level, inplace, errors
- axis0 = 로우 방향 축, axis1 = 칼럼 방향 축
- 원본 데이터 프레임 유지 : inplace=False
- 원본 데이터 프레임 드롭된 결과 적용 : inplace=True

In [72]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      360.0          1

In [73]:
titanic_df.head(3)
# drop(inplae=False)로 설정한 경우(디폴트) 원본 데이터프레임의 데이터는 삭제하지 않음

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      360.0          1

In [74]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print(' inplace=True로 drop 후 반환된 값 :', drop_result)
titanic_df.head(3)

 inplace=True로 drop 후 반환된 값 : None

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [76]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))
titanic_df.drop([0,1,2], axis=0, inplace=True)
print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

### Index 객체

In [77]:
# 원본 파일 다시 로딩
titanic_df = pd.read_csv('titanic_train.csv')
# index 객체 추출
indexes = titanic_df.index
print(indexes)
# index 객체를 실제 값 (1차원) array로 변환 
print('Index 객체 array 값 :\n', indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체 array 값 :
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [79]:
print(type(indexes.values))
print(indexes.values.shape) # 1차원 array
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [80]:
# 한 번 만들어진 Dataframe 및 Series의 index 객체는 함부로 변경 불가.
indexes[0] = 5

TypeError: Index does not support mutable operations

In [82]:
series_fair = titanic_df['Fare']
print('Fair Series max 값 : ', series_fair.max())
print('Fair Series sum 값 : ', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series +3:\n', (series_fair +3).head(3))

Fair Series max 값 :  512.3292
Fair Series sum 값 :  28693.9493
sum() Fair Series: 28693.949299999967
Fair Series +3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [84]:
# reset_index 메서드 : 새롭게 인덱스를 연속 숫자형으로 할당, 기존 인덱스는 'index' 라는 새로운 칼럼 명으로 추가
# 연속된 숫자 index가 아닐 경우 연속형으로 만들 때 사용
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [87]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입 :', type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)
print('new_value_counts 객체 변수 타입 :', type(new_value_counts))

# reset_index(drop=True)로 설정하면 기존 인덱스는 새로운 칼럼으로 추가되지 않고 삭제됨

### before reset_index ###
Pclass
3    491
1    216
2    184
Name: count, dtype: int64
value_counts 객체 변수 타입 : <class 'pandas.core.series.Series'>
### After reset_index ###
   Pclass  count
0       3    491
1       1    216
2       2    184
new_value_counts 객체 변수 타입 : <class 'pandas.core.frame.DataFrame'>

### 데이터 셀렉션 및 필터링
- 넘파이, 판다스의 데이터 셀렉션과 필터링은 유사한 부분도 있고 다른 부분도 있음.
1. 넘파이 - [] 연산자 내 단일 값 추출, 슬라이싱, 팬시 인덱싱, 불린 인덱싱
2. 판다스 - ix[], iloc[], loc[] 연산자로 동일한 작업 수행
---
#### Dataframe의 [] 연산자
- 데이터 프레임 바로 뒤 []연산자 =/= 넘파이 [] or Series []
- 데이터 프레임 바로 뒤 [] 입력 값 : 칼럼 지정 연산 or 불린 인덱스로 사용
- 슬라이싱 연산으로 데이터를 추출하는 방법은 비추천
---
#### Dataframe의 ix[] 연산자
- 행 위치 지정(dataframe의 인덱스), 열 위치 지정 가능
- 현재 판다스에서는 사라짐
- 이를 대신해 칼럼 명칭 기반 인덱상 **loc[]**, 칼럼 위치 기반 인덱싱 **iloc[]**
- 넘파이 ndarray와 같이 단일 지정, 슬라이싱, 불린/팬시 인덱싱 모두 가능
- Dataframe의 인덱스는 명칭 기반 인덱싱으로 간주
--- 
#### 명칭 기반 인덱싱과 위치 기반 인덱싱의 구분
1. 명칭 (Label) 기반 인덱싱 **loc[]**
-  칼럼 명칭 기반으로, 열 위치를 지정하는 방식
2. 위치 (Position) 기반 인덱싱 **iloc[]**
- 0을 출발점으로 하는 가로축, 세로축 좌표 기반의 행,열 위치 기반으로 데이터를 지정하는 방식
- integer(형)의 슬라이싱, 팬시 리스트 값을 입력
- 불린 인덱싱은 제공 x
3. ix, iloc, loc의 문제점과 주의사항
- 명칭 기반 : 데이터프레임의 인덱스나 칼럼명으로 데이터에 접근하는 인덱싱 기법 vs 위치 기반 : 0부터 시작하는 행/열의 위치 좌표에 의존해 접근하는 인덱싱 기법
- ix[]는 명칭/위치 모두 적용 가능. 데이터 프레임의 인덱스가 숫자형인 경우 행 위치 숫자는 위치 기반이 아닌 명칭 기반의 인덱스를 가리킴
- iloc[]은 위치 기반 인덱싱만 가능. 행/열 위치 값으로는 정수형 값을 지정
- loc[]는 명칭 기반 인덱싱만 가능. 행-인덱스, 열-칼럼명
- 명칭 기반 인덱싱에서 시작점:종료점은 시작점~종료점 위치 데이터 모두 반환

In [90]:
print('단일 칼럼 데이터 추출:\n', titanic_df['Pclass'].head(3))
print('\n여러 칼럼 데이터 추출:\n', titanic_df[['Survived', 'Pclass']].head(3))
print('[] 안에 있는 숫자 index는 keyerror 오류 발생:\n', titanic_df[0])
# Dataframe[] <- []에는 칼럼명을 지정해야 함.

단일 칼럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 칼럼 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [95]:
# 판다스의 인덱스 형태로 변환가능한 표현식은 [] 내에 입력 가능.
titanic_df[0:2]
# 불린 인덱싱 표현
titanic_df[titanic_df['Pclass']==3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

In [96]:
print('칼럼 위치 기반 인덱싱 추출:', titanic_df.ix[0,2])
print('칼럼 명 기반 인덱싱 데이터 추출:', titanic_df.ix[0, 'Pclass'])

AttributeError: 'DataFrame' object has no attribute 'ix'

In [98]:
data = {'Name':['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year' : [2011, 2016, 2015, 2015],
        'Gender' : ['Male', 'Female', 'Male', 'Male']
       }
print(data)
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

{'Name': ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'], 'Year': [2011, 2016, 2015, 2015], 'Gender': ['Male', 'Female', 'Male', 'Male']}

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [117]:
# data_df를  reset_index()로 새로운 숫자형 인덱스 생성
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})

# 인덱스값에 1을 더해서 1부터 시작하는 새로운 인덱스 생성
data_df_reset.index = data_df_reset.index + 1
data_df_reset

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

In [122]:
data_df_reset.ix[0,1]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [123]:
data_df_reset.ix[1,1]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [124]:
# iloc[] 연산자
data_df.iloc[0,0]

'Chulmin'

In [125]:
data_df.iloc[0,'Name']
# 위치가 아닌 명칭으로 인덱싱하면 오류 발생

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [126]:
data_df.iloc['one',0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [127]:
data_df_reset.iloc[0,1]
# ix의 경우 행 위치에 인덱스값 0을 찾지 못해 오류가 발생한 반면, 명확한 위치 기반 인덱싱 iloc는 성공적으로 값을 반환

'Chulmin'

In [128]:
# loc[] 연산자
data_df.loc['one', 'Name']

'Chulmin'

In [130]:
data_df_reset.loc[1,'Name']
# index가 숫자형일 수도 있음. 명칭 기반이어도 숫자 입력 가능

'Chulmin'

In [131]:
data_df_reset.loc[0,'Name']
# 인덱스값이 0인 행이 없으므로 오류 발생

KeyError: 0

In [133]:
print('명칭 기반 ix slicing\n:', data_df.ix['one':'two', 'Name'], '\n')

AttributeError: 'DataFrame' object has no attribute 'ix'

In [135]:
print('위치 기반 iloc slicing\n:', data_df.iloc[0:1, 0], '\n')
print('명칭 기반 loc slicing\n:', data_df.loc['one':'two', 'Name'])

위치 기반 iloc slicing
: one    Chulmin
Name: Name, dtype: object

명칭 기반 loc slicing
: one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [137]:
print(data_df_reset.loc[1:2, 'Name'])
# loc는 명칭 기반 인덱싱이므로 인덱스 1,2 에 해당하는 2개의 데이터 반환

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

In [141]:
print(data_df.ix[1:2, 'Name'])

AttributeError: 'DataFrame' object has no attribute 'ix'

### 불린 인덱싱
- [], ix[], loc[]에서 지원

In [143]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
# 승객 중 나이가 60세 이상인 데이터만 추출
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [144]:
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)
# 불린 인덱싱으로 원하는 조건만 추출한 후, 원하는 칼럼명만 별도로 추출, 상위 3개의 데이터만 보임

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [145]:
titanic_df.loc[titanic_df['Age']>60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [146]:
# 여러 개의 복합 조건 적용
# and : &, or : |, Not : ~
# 방법 1
titanic_df[(titanic_df['Age']>60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [147]:
# 방법 2
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[cond1&cond2&cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

### 정렬, Aggregation 함수, GroupBy 적용
#### DataFrame, Series의 정렬 - sort_values()
- SQL의 order by와 유사
- by(해당 칼럼으로 정렬), ascending(오름차순), inplace(False가 디폴트)
#### Aggregation 함수 적용
- SQL의 aggregation 함수와 유사
- Dataframe의 경우 모든 칼럼에 해당 aggregation을 적용한다는 점에서 차이가 있음.
#### Groupby 적용
- SQL의 group by와 달리 groupby()는 호출해 반환된 결과에 aggregation 함수를 호출하면 groupby() 대상 칼럼을 제외한 모든 aggregation 함수를 적용함

In [148]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [149]:
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)
# pclass와 name을 내림차순으로 정렬

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

In [150]:
# Aggregation
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [151]:
titanic_df[['Age', 'Fare']].mean()
# 모든 칼럼이 아닌 특정 칼럼에만 함수 적용

Age     29.699118
Fare    32.204208
dtype: float64

In [153]:
# Groupby
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [154]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [155]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [156]:
titanic_df.groupby('Pclass')['Age'].agg(['max','min'])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [157]:
# 여러 칼럼이 서로 다른 aggregation을 groupby에서 호출하려면 SQL보다 복잡한 처리가 필요함
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

### 결손 데이터(Missing Data) 처리하기
결손 데이터 : 칼럼에 값이 없는, 즉 NULL인 경우. 넘파이의 NaN으로 표시
머신러닝 알고리즘은 NaN을 처리하지 않음 ; 다른 값으로 대체
#### isna()로 결손 데이터 여부 확인
#### fillna()로 결손 데이터 대체

In [158]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [159]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [161]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [162]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### apply lambda로 데이터 가공
- apply 함수에 lambda 식을 결합해 dataframe이나 series의 레코드별로 데이터를 가공
- lambda 식 : 파이썬에서 함수형 프로그래밍을 지원하기 위해 만들어짐

In [164]:
# 함수명과 입력 인자를 먼저 선언 후 함수 내에서 입력 인자를 가공한 뒤 return으로 결괏값 반환
def get_square(a) :
    return a**2

print('3의 제곱은', get_square(3))

3의 제곱은 9

In [165]:
# 함수의 선언과 함수 내 처리를 한 줄의 식으로 쉽게 변환, :로 입력 인자와 반환 입력 인자의 계산식 분리
lambda_square = lambda x : x**2
print('3의 제곱은:', get_square(3))

3의 제곱은: 9

In [167]:
# 여러 개의 값을 입력 인자로 사용할 경우 map() 함수를 결합
a = [1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [168]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [169]:
# lambda에서 if절의 경우 if 식보다 반환값을 먼저 기술. else의 경우 반환값이 나중에 옴. 
# elif는 지원하지 않음.
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [170]:
# lambda에서 elif 사용은 else 절을 ()로 내포해 다시 if else를 적용
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Age_cat
Adult      786
Child       83
Elderly     22
Name: count, dtype: int64

In [172]:
# else if 가 많거나 switch case문의 경우 별도의 함수를 만드는 것이 편리.
def get_category(age) :
    cat = ''
    if age <= 5 : cat = 'Baby'
    elif age <= 12 : cat = 'Child'
    elif age <= 18 : cat = 'Teenager'
    elif age <= 25 : cat = 'Student'
    elif age <= 35 : cat = 'Young Adult'
    elif age <= 60 : cat = 'Adult'
    else : cat = 'Elderly'

    return cat

# lambda 식에 위에 생성한 get_category() 함수를 반환값으로 지정
# get_category()는 입력값으로 'age' 칼럼 값을 받아 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult